## OpenTofu Plan

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_subscription_association.identity_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "identity_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-identity"
      + subscription_id     = (sensitive value)
    }

  # azurerm_management_group_subscription_association.management_nonprod will be created
  + resource "azurerm_management_group_subscription_association" "management_nonprod" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-management"
      + subscription_id     = (sensitive value)
    }

  # module.sub_identity_nonprod_rbac.azurerm_role_assignment.tf_apply_contributor will be created
  + resource "azurerm_role_assignment" "tf_apply_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_identity_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Locks Manager (RG/Resource)"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_identity_nonprod_rbac.azurerm_role_assignment.tf_apply_rbac_admin will be created
  + resource "azurerm_role_assignment" "tf_apply_rbac_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_management_nonprod_rbac.azurerm_role_assignment.tf_apply_contributor will be created
  + resource "azurerm_role_assignment" "tf_apply_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_management_nonprod_rbac.azurerm_role_assignment.tf_apply_lock_manager will be created
  + resource "azurerm_role_assignment" "tf_apply_lock_manager" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Locks Manager (RG/Resource)"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sub_management_nonprod_rbac.azurerm_role_assignment.tf_apply_rbac_admin will be created
  + resource "azurerm_role_assignment" "tf_apply_rbac_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Role Based Access Control Administrator"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
